
__author__ = 'Гурьянов Андрей Юрьевич'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)

# Видимо это как-то связано с максимальным значением, которое может обратобоать Python и после которог заданные условия будут выполняться.
# Но я, к сожалению, не знаю как его найти в 3-ей версии Python.
